stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F091.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SYSCFG</name>
            <description>System configuration controller</description>
            <groupName>SYSCFG</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CFG1</name>
                    <displayName>CFG1</displayName>
                    <description>configuration register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMSEL</name>
                            <description>Memory mapping selection
bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>IRSEL</name>
                            <description>IR Modulation Envelope Signal Select</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>I2CPB6FMP</name>
                            <description>Fast Mode Plus (FM plus) driving
capability activation bits.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CPB7FMP</name>
                            <description>Fast Mode Plus (FM+) driving capability activation bits.</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CPB8FMP</name>
                            <description>Fast Mode Plus (FM+) driving capability activation bits.</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CPB9FMP</name>
                            <description>Fast Mode Plus (FM+) driving capability activation bits.</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1FMP</name>
                            <description>FM+ driving capability activation for I2C1</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2FMP</name>
                            <description>FM+ driving capability activation for I2C1</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CPA9FMP</name>
                            <description>Fast Mode Plus Driving
Capability Activate for PA9</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CPA10FMP</name>
                            <description>Fast Mode Plus Driving
Capability Activate for PA10</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG1</name>
                    <displayName>EINTCFG1</displayName>
                    <description>external interrupt configuration register 1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT3</name>
                            <description>EINT 3 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT2</name>
                            <description>EINT 2 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT1</name>
                            <description>EINT 1 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT0</name>
                            <description>EINT 0 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG2</name>
                    <displayName>EINTCFG2</displayName>
                    <description>external interrupt configuration register 2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT7</name>
                            <description>EINT 7 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT6</name>
                            <description>EINT 6 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT5</name>
                            <description>EINT 5 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT4</name>
                            <description>EINT 4 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG3</name>
                    <displayName>EINTCFG3</displayName>
                    <description>external interrupt configuration register 3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT11</name>
                            <description>EINT 11 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT10</name>
                            <description>EINT 10 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT9</name>
                            <description>EINT 9 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT8</name>
                            <description>EINT 8 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG4</name>
                    <displayName>EINTCFG4</displayName>
                    <description>external interrupt configuration register 4</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT15</name>
                            <description>EINT 15 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT14</name>
                            <description>EINT 14 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT13</name>
                            <description>EINT 13 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT12</name>
                            <description>EINT 12 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG2</name>
                    <displayName>CFG2</displayName>
                    <description>configuration register 2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>SRAMEFLG</name>
                            <description>SRAM parity error flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDLOCK</name>
                            <description>PVD lock enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMLOCK</name>
                            <description>SRAM parity lock bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>Cortex-M0 Hardfault  enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
