stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F091.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>CAN</name>
            <description>Controller area network</description>
            <groupName>CAN</groupName>
            <baseAddress>0x40006400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CEC_CAN</name>
                <description>CEC and CAN global interrupt</description>
                <value>30</value>
            </interrupt>
            <registers>
                <register>
                    <name>MCTRL</name>
                    <displayName>MCTRL</displayName>
                    <description>CAN master control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00010002</resetValue>
                    <fields>
                        <field>
                            <name>DBGFRZE</name>
                            <description>Debug freeze</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>software master reset</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALBOFFM</name>
                            <description>Automatic bus-off management</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWUPCFG</name>
                            <description>Automatic wakeup mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARTXMD</name>
                            <description>No automatic retransmission</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFLOCK</name>
                            <description>Receive FIFO locked mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFPCFG</name>
                            <description>Transmit FIFO priority</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SLEEPREQ</name>
                            <description>Sleep mode request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INITREQ</name>
                            <description>Initialization request</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTS</name>
                    <displayName>MSTS</displayName>
                    <description>CAN master status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000C02</resetValue>
                    <fields>
                        <field>
                            <name>RXSIGL</name>
                            <description>CAN Rx signal</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LSAMVALUE</name>
                            <description>Last sample point</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXMFLG</name>
                            <description>Receive mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMFLG</name>
                            <description>Transmit mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SLEEPIFLG</name>
                            <description>Sleep acknowledge interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUPIFLG</name>
                            <description>Wakeup interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIFLG</name>
                            <description>Error interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLEEPFLG</name>
                            <description>Sleep acknowledge</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INITFLG</name>
                            <description>Initialization acknowledge</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXSTS</name>
                    <displayName>TXSTS</displayName>
                    <description>CAN transmit status register </description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x1C000000</resetValue>
                    <fields>
                        <field>
                            <name>LOWESTP2</name>
                            <description>Lowest priority flag for mailbox2</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOWESTP1</name>
                            <description>Lowest priority flag for mailbox1</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOWESTP0</name>
                            <description>Lowest priority flag for mailbox0</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG2</name>
                            <description>Transmit mailbox 2 empty</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG1</name>
                            <description>Transmit mailbox 1 empty</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXMEFLG0</name>
                            <description>Transmit mailbox 0 empty</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EMNUM</name>
                            <description>Mailbox code</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ABREQFLG2</name>
                            <description>Abort request for mailbox 2</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG2</name>
                            <description>Transmission error of mailbox 2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG2</name>
                            <description>Arbitration lost for mailbox 2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG2</name>
                            <description>Transmission OK of mailbox 2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REQCFLG2</name>
                            <description>Request completed mailbox 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABREQFLG1</name>
                            <description>Abort request for mailbox 1</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG1</name>
                            <description>Transmission error of mailbox 1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG1</name>
                            <description>Arbitration lost for mailbox 1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG1</name>
                            <description>Transmission OK of mailbox 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REQCFLG1</name>
                            <description>Request completed mailbox 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABREQFLG0</name>
                            <description>Abort request for mailbox 0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXERRFLG0</name>
                            <description>Transmission error of mailbox 0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARBLSTFLG0</name>
                            <description>Arbitration lost for mailbox 0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXSUSFLG0</name>
                            <description>Transmission OK of mailbox .</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REQCFLG0</name>
                            <description>Request completed mailbox 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF0</name>
                    <displayName>RXF0</displayName>
                    <description>CAN receive FIFO 0 register </description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFOM0</name>
                            <description>Release FIFO 0 output mailbox</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOVRFLG0</name>
                            <description>FIFO 0 overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FFULLFLG0</name>
                            <description>FIFO 0 full</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMNUM0</name>
                            <description>FIFO 0 message pending</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXF1</name>
                    <displayName>RXF1</displayName>
                    <description>CAN receive FIFO 1 register </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RFOM1</name>
                            <description>Release FIFO 1 output mailbox</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOVRFLG1</name>
                            <description>FIFO 1 overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FFULLFLG1</name>
                            <description>FIFO 1 full</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FMNUM1</name>
                            <description>FIFO 1 message pending</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
