stephenshizl/tanker-flow-mcu/Utilities/SVD/APM32F091.svd
                <register>
                    <name>TXDLEN2</name>
                    <displayName>TXDLEN2</displayName>
                    <description>CAN mailbox 2 data length control and time stamp register</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DLCODE</name>
                            <description>Data length code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDL2</name>
                    <displayName>TXMDL2</displayName>
                    <description>CAN mailbox 2 data low register</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXMDH2</name>
                    <displayName>TXMDH2</displayName>
                    <description>CAN mailbox 2 data high register</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE7</name>
                            <description>Data byte 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>Data byte 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>Data byte 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE4</name>
                            <description>Data byte 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMID0</name>
                    <displayName>RXMID0</displayName>
                    <description>CAN receive FIFO 0 mailbox  identifier register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STDID</name>
                            <description>Standard identifier or extended identifier</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>Extended identifier</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>Identifier extension</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFTXREQ</name>
                            <description>Remote transmission request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDLEN0</name>
                    <displayName>RXDLEN0</displayName>
                    <description>CAN receive FIFO 0 mailbox data length control and time stamp register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMIDX</name>
                            <description>Filter match index</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DLCODE</name>
                            <description>Data length code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDL0</name>
                    <displayName>RXMDL0</displayName>
                    <description>CAN receive FIFO 0 mailbox data low register </description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDH0</name>
                    <displayName>RXMDH0</displayName>
                    <description>CAN receive FIFO 0 mailbox data high register </description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE7</name>
                            <description>Data byte 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>Data byte 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>Data byte 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE4</name>
                            <description>Data byte 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMID1</name>
                    <displayName>RXMID1</displayName>
                    <description>CAN receive FIFO 1 mailbox  identifier register</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STDID</name>
                            <description>Standard identifier or extended identifier</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EXTID</name>
                            <description>Extended identifier</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>18</bitWidth>
                        </field>
                        <field>
                            <name>IDTYPESEL</name>
                            <description>Identifier extension</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFTXREQ</name>
                            <description>Remote transmission request</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXDLEN1</name>
                    <displayName>RXDLEN1</displayName>
                    <description>CAN receive FIFO 1 mailbox data length control and time stamp register</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMIDX</name>
                            <description>Filter match index</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DLCODE</name>
                            <description>Data length code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDL1</name>
                    <displayName>RXMDL1</displayName>
                    <description>CAN receive FIFO 1 mailbox data low register </description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXMDH1</name>
                    <displayName>RXMDH1</displayName>
                    <description>CAN receive FIFO 1 mailbox data high register </description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABYTE7</name>
                            <description>Data byte 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE6</name>
                            <description>Data byte 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE5</name>
                            <description>Data byte 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATABYTE4</name>
                            <description>Data byte 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTRL</name>
                    <displayName>FCTRL</displayName>
                    <description>CAN filter master register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x2A1C0E01</resetValue>
                    <fields>
                        <field>
                            <name>FINITEN</name>
                            <description>Filter initialization mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMCFG</name>
                    <displayName>FMCFG</displayName>
                    <description>CAN filter mode register</description>
                    <addressOffset>0x204</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FMCFG0</name>
                            <description>Filter 0 mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG1</name>
                            <description>Filter 1 mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG2</name>
                            <description>Filter 2 mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG3</name>
                            <description>Filter 3 mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG4</name>
                            <description>Filter 4 mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG5</name>
                            <description>Filter 5 mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG6</name>
                            <description>Filter 6 mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG7</name>
                            <description>Filter 7 mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG8</name>
                            <description>Filter 8 mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG9</name>
                            <description>Filter 9 mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG10</name>
                            <description>Filter 10 mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG11</name>
                            <description>Filter 11 mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG12</name>
                            <description>Filter 12 mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCFG13</name>
                            <description>Filter 13 mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
